Ran Plan for dir: `.` workspace: `atlantis-atlantis`

**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "if [ \"$(grep -o 'FAILED' policy-plan |sort -u)\" = \"FAILED\" ]; then rm -rf $PLANFILE policy-plan && echo \"Policy check has failed. Please check the failed policies\" && exit 1;fi" in "/root/.atlantis/repos/RJGcp/rj-gce_project_1/3/atlantis-atlantis": 
Policy check has failed. Please check the failed policies

TERRAFORM PLAN:


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.instances[0] will be created
+ resource "google_compute_address" "instances" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "p-a-cos-0"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_disk.additional_disk[0] will be created
+ resource "google_compute_disk" "additional_disk" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "test-disk"
      + physical_block_size_bytes = (known after apply)
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + size                      = 10
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-ssd"
      + users                     = (known after apply)
      + zone                      = "us-west4-a"
    }

  # google_compute_instance.prod_instances[0] will be created
+ resource "google_compute_instance" "prod_instances" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = true
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n2-standard-2"
      + metadata             = {
          + "block-project-ssh-keys" = "true"
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "p-a-cos"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "rj",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-west4-a"

      + attached_disk {
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = "test-disk"
        }

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "{var.disk_image}"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = "pd-ssd"
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = "MIGRATE"
          + preemptible         = false
        }

      + service_account {
          + email  = "rj-admin-iac-sa-01@eb-shared-devops-01.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ addresses = (known after apply)

POLICY CHECK:



       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.0.330 
Update available 2.0.330 -> 2.0.828
Run pip3 install -U checkov to update 


terraform_plan scan results:

Passed checks: 9, Failed checks: 1, Skipped checks: 0

Check: CKV_GCP_32: "Ensure 'Block Project-wide SSH keys' is enabled for VM instances"
	FAILED for resource: google_compute_instance.prod_instances
	File: main.tf:38-77
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_networking_8

		38 | resource "google_compute_instance" "prod_instances" {
		39 |   count = "${local.is_prod}" ? 1 : 0
		40 | 
		41 |   name                = var.instance_name
		42 |   zone                = var.zone
		43 |   machine_type        = var.machine_type
		44 | 
		45 |   metadata = {
		46 |     block-project-ssh-keys = true
		47 |   }
		48 |   boot_disk {
		49 |     initialize_params {
		50 |       image       = "{var.disk_image}"
		51 |       type        = "pd-ssd"
		52 |     }
		53 |   }
		54 |   deletion_protection = true
		55 |   tags                = "${var.tags}"
		56 |   attached_disk {
		57 |     source = google_compute_disk.additional_disk.*.name[count.index]
		58 |   }
		59 | 
		60 | 
		61 | 
		62 |   network_interface {
		63 |     network = var.network
		64 | 
		65 |     access_config {
		66 |       nat_ip = google_compute_address.instances.*.address[count.index]
		67 |     }
		68 |   }
		69 |   service_account {
		70 |     email = "rj-admin-iac-sa-01@eb-shared-devops-01.iam.gserviceaccount.com"
		71 |     scopes = ["cloud-platform"]
		72 |   }
		73 |   scheduling {
		74 |     on_host_maintenance = "MIGRATE"
		75 |     automatic_restart   = "true"
		76 |   }
		77 | }



```
</details>

